-------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\acsnfs4.ucsd.edu\CifsHomes\663\shl500\PS3Problem1.log
  log type:  text
 opened on:  26 Feb 2019, 22:00:28

. count if countryname!=""
  264

. tab countryname if laborforcetotal==.

                            countryname |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         American Samoa |          1        3.13        3.13
                                Andorra |          1        3.13        6.25
                    Antigua and Barbuda |          1        3.13        9.38
                                  Aruba |          1        3.13       12.50
                                Bermuda |          1        3.13       15.63
                 British Virgin Islands |          1        3.13       18.75
                         Cayman Islands |          1        3.13       21.88
                                Curacao |          1        3.13       25.00
                               Dominica |          1        3.13       28.13
                                Eritrea |          1        3.13       31.25
                          Faroe Islands |          1        3.13       34.38
                              Gibraltar |          1        3.13       37.50
                              Greenland |          1        3.13       40.63
                                Grenada |          1        3.13       43.75
                            Isle of Man |          1        3.13       46.88
                               Kiribati |          1        3.13       50.00
                                 Kosovo |          1        3.13       53.13
                          Liechtenstein |          1        3.13       56.25
                       Marshall Islands |          1        3.13       59.38
                  Micronesia, Fed. Sts. |          1        3.13       62.50
                                 Monaco |          1        3.13       65.63
                                  Nauru |          1        3.13       68.75
               Northern Mariana Islands |          1        3.13       71.88
                         Not classified |          1        3.13       75.00
                                  Palau |          1        3.13       78.13
                             San Marino |          1        3.13       81.25
                             Seychelles |          1        3.13       84.38
              Sint Maarten (Dutch part) |          1        3.13       87.50
                    St. Kitts and Nevis |          1        3.13       90.63
               St. Martin (French part) |          1        3.13       93.75
               Turks and Caicos Islands |          1        3.13       96.88
                                 Tuvalu |          1        3.13      100.00
----------------------------------------+-----------------------------------
                                  Total |         32      100.00

. count if  inflationconsumerpricesannual> gdpgrowthannual & (inflationconsumerpricesannual < . & gdpgrowthannual < .)
  68

. count if lifeexpectancyatbirthmaleyears > lifeexpectancyatbirthfemaleyears & (lifeexpectancyatbirthmaleyears < . & lifeexpectancyatbirthfemaleyears <
>  .)
  0

. count if lifeexpectancyatbirthfemaleyears-lifeexpectancyatbirthmaleyears > 5 & (lifeexpectancyatbirthfemaleyears < . & lifeexpectancyatbirthmaleyears < .)
  93

. scatter gdpconstant2010us laborforcetotal, title("Labor Force & GDP")

. regress gdpconstant2010us laborforcetotal

      Source |       SS           df       MS      Number of obs   =       218
-------------+----------------------------------   F(1, 216)       =    285.96
       Model |  1.0254e+28         1  1.0254e+28   Prob > F        =    0.0000
    Residual |  7.7457e+27       216  3.5860e+25   R-squared       =    0.5697
-------------+----------------------------------   Adj R-squared   =    0.5677
       Total |  1.8000e+28       217  8.2950e+25   Root MSE        =    6.0e+12

---------------------------------------------------------------------------------
gdpconstant20~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
laborforcetotal |   14493.23    857.059    16.91   0.000     12803.96     16182.5
          _cons |   5.60e+11   4.29e+11     1.30   0.193    -2.86e+11    1.41e+12
---------------------------------------------------------------------------------

. scatter gdpconstant2010us laborforcetotal || lfit gdpconstant2010us laborforcetotal, title("Labor Force & GDP")

. gen ln_gdpconstant2010us = log(gdpconstant2010us)
(35 missing values generated)

. gen ln_laborforcetotal = log(laborforcetotal)
(37 missing values generated)

. scatter ln_gdpconstant2010us ln_laborforcetotal

. log close
      name:  <unnamed>
       log:  \\acsnfs4.ucsd.edu\CifsHomes\663\shl500\PS3Problem1.log
  log type:  text
 closed on:  26 Feb 2019, 22:16:50
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
